---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AreaLoad Methods
AreaLoad Class See Also Send Feedback
---

The AreaLoad type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | AreCurveLoopsValid | Checks if curve loops are valid for creating an area load. |
|  | ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.  (Inherited from Element.) |
|  | CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from Element.) |
|  | CanBeLocked | Identifies if the element can be locked.  (Inherited from Element.) |
|  | CanDeleteSubelement | Checks if given subelement can be removed from the element.  (Inherited from Element.) |
|  | CanHaveTypeAssigned()()()() | Identifies if the element can have a type assigned.  (Inherited from Element.) |
|  | ChangeTypeId(ElementId) | Changes the type of the element.  (Inherited from Element.) |
|  | Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
|  | Create(Document, ElementId, IList<(Of <<'(CurveLoop>)>>), XYZ, AreaLoadType) | Creates a new custom area load within the project. |
|  | Create(Document, ElementId, IList<(Of <<'(CurveLoop>)>>), IList<(Of <<'(XYZ>)>>), IList<(Of <<'(Int32>)>>), IList<(Of <<'(Int32>)>>), AreaLoadType) | Creates a new custom area load within the project. |
|  | DeleteEntity | Deletes the existing entity created by %schema% in the element  (Inherited from Element.) |
|  | DeleteSubelement | Removes a subelement from the element.  (Inherited from Element.) |
|  | DeleteSubelements | Removes the subelements from the element.  (Inherited from Element.) |
|  | Dispose | (Inherited from Element.) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | EvaluateAllParameterValues | Evaluates all the parameters' values of the element.  (Inherited from Element.) |
|  | EvaluateParameterValues | Evaluate the parameters' values of the element on the given parameter ID set.  (Inherited from Element.) |
|  | GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element.  (Inherited from Element.) |
|  | GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.  (Inherited from Element.) |
|  | GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element.  (Inherited from Element.) |
|  | GetExternalFileReference | Gets information pertaining to the external file referenced by the element.  (Inherited from Element.) |
|  | GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
|  | GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
|  | GetExternalResourceReferences | Gets the map of the external resource references referenced by the element.  (Inherited from Element.) |
|  | GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element.  (Inherited from Element.) |
|  | GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object.  (Inherited from Element.) |
|  | GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference.  (Inherited from Element.) |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetLoops | Returns curve loops that define geometry of the area load. |
|  | GetMaterialArea | Gets the area of the material with the given id.  (Inherited from Element.) |
|  | GetMaterialIds | Gets the element ids of all materials present in the element.  (Inherited from Element.) |
|  | GetMaterialVolume | Gets the volume of the material with the given id.  (Inherited from Element.) |
|  | GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring.  (Inherited from Element.) |
|  | GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring.  (Inherited from Element.) |
|  | GetOrderedParameters | Gets the parameters associated to the element in order.  (Inherited from Element.) |
|  | GetParameter | Retrieves a parameter from the element given identifier. (Inherited from Element.) |
|  | GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.  (Inherited from Element.) |
|  | GetParameters | Retrieves the parameters from the element via the given name. (Inherited from Element.) |
|  | GetPhaseStatus | Gets the status of a given element in the input phase  (Inherited from Element.) |
|  | GetRefPoint | Returns the physical location of the reference point. |
|  | GetSubelements | Returns the collection of element subelements.  (Inherited from Element.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | GetTypeId | Returns the identifier of this element's type.  (Inherited from Element.) |
|  | GetValidTypes()()()() | Obtains a set of types that are valid for this element.  (Inherited from Element.) |
|  | HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.  (Inherited from Element.) |
|  | IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
|  | IsCurveLoopsInsideHostBoundaries | Checks if contour loops is inside host boundaries. |
|  | IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
|  | IsExternalFileReference | Determines whether this Element represents an external file.  (Inherited from Element.) |
|  | IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from Element.) |
|  | IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models.  (Inherited from Element.) |
|  | IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements.  (Inherited from Element.) |
|  | IsOrientToPermitted | Indicates if the provided orientation is permitted for this load.  (Inherited from LoadBase.) |
|  | IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.  (Inherited from Element.) |
|  | IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.  (Inherited from Element.) |
|  | IsValidHostId | Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical element that is about to host an area load True if an area load can be placed on the input host id |
|  | IsValidType(ElementId) | Checks if given type is valid for this element.  (Inherited from Element.) |
|  | LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from Element.) |
|  | RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type.  (Inherited from Element.) |
|  | RefersToExternalResourceReferences | Determines whether this Element uses external resources.  (Inherited from Element.) |
|  | RemoveHostConstraint | Removes constraint from host for this load.  (Inherited from LoadBase.) |
|  | SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.  (Inherited from Element.) |
|  | SetLoops | Sets curve loops that define geometry of the area load. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace